======
Plain docstring line
======
"! this is a docstring
---
(source
    (docstring
        (paragraph)))
======
Seperated docstrings
======
"! this is a docstring

"! This is the second docstring
---
(source
    (docstring
        (paragraph))
    (docstring
        (paragraph)))
======
Multi line docstrings
======
"! this is a docstring
"! This is the second docstring
"! And this is the third
"! And this the fourth
---
(source
    (docstring
        (paragraph)
        (paragraph)
        (paragraph)
        (paragraph)))
======
Empty line docstring
======
"!

test = 10.
---
(source
    (docstring)
    (assignment
        (identifier)
        (number)))
======
Split documentation tags
======
"! This is a generic docstring for your method that is undoubtedly completely free of bugs
"! and entirely optimized.
"!
"! @parameter iv_param1 | Explains the parameters purpose, should be highlighted!
"! @parameter iv_param2 | Explains the parameters purpose, should be highlighted!
"!
"! @raising cx_error | This is the class based error that can be raised
"!
"! @exception sleepy_gay | This is an exception that could be raised
---
(source
    (docstring
        (paragraph)
        (paragraph)
        (doctag
            (tag)
            (identifier)
            (paragraph))
        (doctag
            (tag)
            (identifier)
            (paragraph))
        (doctag
            (tag)
            (identifier)
            (paragraph))
        (doctag
            (tag)
            (identifier)
            (paragraph))))
======
Predefined tag missing docstring
======
"! @parameter i_dont_have_documentation 
---
(source
    (docstring
        (doctag
            (tag)
            (identifier))))
======
Spacing required between docstring
:error
======
"! @parameter exclamation_mark_is_not_valid!
---
(source)
======
User defined tags
======
"! Bla bla bla this is boring text!!
"!
"! @parameter iv_param1 | My parameter
"! @note This technically isnt an @ABAPDOC@@ feature but I think its cool!
---
(source
    (docstring
        (paragraph)
        (doctag
            (tag)
            (identifier)
            (paragraph))
        (doctag
            (tag)
            (paragraph))))
======
Escape doclinks
======
"! @parameter foo | An instance of something \{ I have no idea what im doing \}
---
(source
    (docstring
        (doctag
            (tag)
            (identifier)
            (paragraph))))