======
Plain docstring line
======
"! this is a docstring
---
(source
    (docstring
        (paragraph)))
======
Seperated docstrings
======
"! this is a docstring

"! This is the second docstring
---
(source
    (docstring
        (paragraph))
    (docstring
        (paragraph)))
======
Multi line docstrings
======
"! this is a docstring
"! This is the second docstring
"! And this is the third
"! And this the fourth
---
(source
    (docstring
        (paragraph)
        (paragraph)
        (paragraph)
        (paragraph)))
======
Empty line docstring
======
"!

test = 10.
---
(source
    (docstring)
    (assignment
        (identifier)
        (number)))
======
Split documentation tags
======
"! This is a generic docstring for your method that is undoubtedly completely free of bugs
"! and entirely optimized.
"!
"! @parameter iv_param1 | Explains the parameters purpose, should be highlighted!
"! @parameter iv_param2 | Explains the parameters purpose, should be highlighted!
"!
"! @raising cx_error | This is the class based error that can be raised
"!
"! @exception sleepy_gay | This is an exception that could be raised
---
(source
    (docstring
        (paragraph)
        (paragraph)
        (doctag
            (tag)
            (identifier)
            (paragraph))
        (doctag
            (tag)
            (identifier)
            (paragraph))
        (doctag
            (tag)
            (identifier)
            (paragraph))
        (doctag
            (tag)
            (identifier)
            (paragraph))))
======
Predefined tag missing docstring
======
"! @parameter i_dont_have_documentation 
---
(source
    (docstring
        (doctag
            (tag)
            (identifier))))
======
Spacing required between docstring
:error
======
"! @parameter exclamation_mark_is_not_valid!
---
(source)
======
User defined tags
======
"! Bla bla bla this is boring text!!
"!
"! @parameter iv_param1 | My parameter
"! @note This technically isnt an @ABAPDOC@@ feature but I think its cool!
---
(source
    (docstring
        (paragraph)
        (doctag
            (tag)
            (identifier)
            (paragraph))
        (doctag
            (tag)
            (paragraph))))
======
Escape doclinks
======
"! @parameter foo | An instance of something \{ I have no idea what im doing \}
---
(source
    (docstring
        (doctag
            (tag)
            (identifier)
            (paragraph))))
======
Doclink to method of local class
======
"! Default html string for method {@link .html.METH:show} 
---
(source
    (docstring
        (paragraph
            (doclink
                (linked_object_path
                    locator: (linked_object_path
                        locator: (scope_directive)
                        comp: (linked_node
                            name: (identifier)))
                    comp: (linked_node
                        kind: (linked_object_kind)
                        name: (identifier)))))))
======
Doclink to repository class object
======
"! @parameter html | Parameter for 
"! {@link cl_abap_browser.METH:show_html.DATA:html_string}. 
---
(source
    (docstring
        (doctag
            (tag)
            (identifier)
            (paragraph))
        (paragraph
            (doclink
            (linked_object_path
                (linked_object_path
                    (linked_node
                        (identifier))
                    (linked_node
                        (linked_object_kind)
                        (identifier)))
                (linked_node
                    (linked_object_kind)
                    (identifier)))))))
======
Doclink with only a single repository identifier
======
"! of {@link cl_abap_browser} 
---
(source
    (docstring
        (paragraph
            (doclink
                (linked_object_path
                    (linked_node
                        (identifier)))))))
======
Doclink with only a single typed repository identifier
======
"! The type must match the technical domain {@link DOMA:/AIF/ACTIONNR}.
---
(source
    (docstring
        (paragraph
            (doclink
                (linked_object_path
                    (linked_node
                        (linked_object_kind)
                        (identifier)))))))
    