======
Simple concatenate statement
======
CONCATENATE foo 'b' foo-bar obj->attr INTO FINAL(str). 
---
(source
    (concatenate
        (data_object_list
            (identifier)
            (string_literal)
            (struct_component_selector
                (identifier)
                (identifier))
            (object_component_selector
                (identifier)
                (identifier)))
        (into_clause
            (result_spec
                (declaration_expression
                    (identifier))))))
======
Concatenate table lines
======
CONCATENATE LINES OF itab INTO FINAL(xstr).
---
(source
    (concatenate
        (lines_of
            (identifier))
        (into_clause
            (result_spec
                (declaration_expression
                    (identifier))))))
======
Concatenate with separator
======
CONCATENATE t1 t2 t3 INTO result SEPARATED BY space.
---
(source
    (concatenate
        (data_object_list
            (identifier)
            (identifier)
            (identifier))
        (into_clause
            (result_spec
                (identifier)))
        (separator_spec
            (identifier))))
======
Concatenate with blanks
======
CONCATENATE LINES OF itab INTO result RESPECTING BLANKS.
---
(source
    (concatenate
        (lines_of
            (identifier))
        (into_clause
            (result_spec
                (identifier)))
        (respecting_blanks)))