======
Simple concatenate statement
======
CONCATENATE foo 'b' foo-bar obj->attr INTO FINAL(str). 
---

(source
  (concatenate_statement
    (data_object_list
      (identifier)
      (string_literal)
      (struct_component_selector
        (identifier)
        (identifier))
      (object_component_selector
        (identifier)
        (identifier)))
    (result
      (declaration_expression
        (identifier)))))

======
Concatenate table lines
======
CONCATENATE LINES OF itab INTO FINAL(xstr).
---

(source
  (concatenate_statement
    (lines_of
      (identifier))
    (result
      (declaration_expression
        (identifier)))))

======
Concatenate with separator
======
CONCATENATE t1 t2 t3 INTO result SEPARATED BY space.
---

(source
  (concatenate_statement
    (data_object_list
      (identifier)
      (identifier)
      (identifier))
    (result
      (identifier))
    (separated_by_spec
      (identifier))))

======
Concatenate with blanks
======
CONCATENATE LINES OF itab INTO result RESPECTING BLANKS.
---

(source
  (concatenate_statement
    (lines_of
      (identifier))
    (result
      (identifier))
    (respecting_blanks_spec)))
