======
Simple type conversion
======
DATA(dcfl34) = CONV decfloat34( '-123.45600' ). 
---

(source
  (assignment
    (declaration_expression
      (keyword_data)
      (identifier))
    (conv_expression
      (keyword_conv)
      (type_identifier)
      (string_literal))))

======
Conversion in arithmetic expressions
======
int = CONV i( sqrt( 5 ) ) + CONV i( sqrt( 6 ) ).
---

(source
  (assignment
    (identifier)
    (binary_operator
      (conv_expression
        (keyword_conv)
        (type_identifier)
        (builtin_function_call
          (identifier)
          (call_argument_list
            (positional_argument
              (number)))))
      (conv_expression
        (keyword_conv)
        (type_identifier)
        (builtin_function_call
          (identifier)
          (call_argument_list
            (positional_argument
              (number))))))))

======
Simple exact conversion
======
FINAL(number) = EXACT numtext( '4 Apples + 2 Oranges' ). 
---

(source
  (assignment
    (declaration_expression
      (keyword_final)
      (identifier))
    (exact_expression
      (keyword_exact)
      (type_identifier)
      (string_literal))))

======
Conversion in arithmetic expressions
======
exact_result = EXACT #( 3 * ( 1 / 3 ) ). 
---

(source
  (assignment
    (identifier)
    (exact_expression
      (keyword_exact)
      (binary_operator
        (number)
        (parenthesized_expression
          (binary_operator
            (number)
            (number)))))))
