======
Simple dynpro parameter
======
PARAMETERS p_carrid TYPE carrid.
---

(source
  (parameters_declaration
    (parameters_spec
      name: (identifier)
      typing: (referred_type_spec
        name: (type_identifier)))))

======
Checkbox dynpro parameter
======
parameters p_impsip as checkbox default abap_true modif id imp.
---

(source
  (parameters_declaration
    (parameters_spec
      name: (identifier)
      checkbox: (checkbox_spec)
      default: (default_value_spec
        value: (identifier))
      modif_id: (modif_id_spec
        id: (identifier)))))

======
Listbox dynpro parameter
======
PARAMETERS p_carrid TYPE carrid
                    AS LISTBOX VISIBLE LENGTH 20 
                    USER-COMMAND onli 
                    DEFAULT 'LH'. 
---

(source
  (parameters_declaration
    (parameters_spec
      name: (identifier)
      typing: (referred_type_spec
        name: (type_identifier))
      listbox: (listbox_spec)
      visible_length: (visible_length_spec
        length: (number))
      user_command: (user_command_spec
        command: (identifier))
      default: (default_value_spec
        value: (string_literal)))))

======
Radiobutton dynpro chained parameters
======
parameters:
	p_queue radiobutton group r1 default 'X',
	p_seq   radiobutton group r1 modif id exp.
---

(source
  (parameters_declaration
    (parameters_spec
      name: (identifier)
      radiobutton: (radiobutton_spec
        group: (identifier))
      default: (default_value_spec
        value: (string_literal)))
    (parameters_spec
      name: (identifier)
      radiobutton: (radiobutton_spec
        group: (identifier))
      modif_id: (modif_id_spec
        id: (identifier)))))

======
Technical dynpro parmeter formatting
======
PARAMETERS p_file  TYPE string LOWER CASE VISIBLE LENGTH 30.
PARAMETERS p_pass  TYPE char10 NO-DISPLAY.
---

(source
  (parameters_declaration
    (parameters_spec
      name: (identifier)
      typing: (builtin_type_spec
        name: (type_identifier))
      case: (lower_case_spec)
      visible_length: (visible_length_spec
        length: (number))))
  (parameters_declaration
    (parameters_spec
      name: (identifier)
      typing: (referred_type_spec
        name: (type_identifier))
      display: (no_display_spec))))

======
Dynpro parameters with search help
======
PARAMETERS p_cust  TYPE kunnr MATCHCODE OBJECT debi.
---

(source
  (parameters_declaration
    (parameters_spec
      name: (identifier)
      typing: (referred_type_spec
        name: (type_identifier))
      search_help: (search_help_spec
        name: (identifier)))))

======
Simple select-option
======
SELECT-OPTIONS s_carrid FOR gv_carrid.
---

(source
  (select_options_declaration
    (select_options_spec
      (identifier)
      (identifier))))

======
Select-option with obligatory and default
======
SELECT-OPTIONS s_date FOR gv_date OBLIGATORY DEFAULT sy-datum.
---

(source
  (select_options_declaration
    (select_options_spec
      (identifier)
      (identifier)
      (obligatory_spec)
      (default_value_spec
        (struct_component_selector
          (identifier)
          (identifier))))))

======
Select-option with complex range default
======
SELECT-OPTIONS s_vbeln FOR gv_vbeln DEFAULT '1000' TO '2000' OPTION BT SIGN I.
---

(source
  (select_options_declaration
    (select_options_spec
      (identifier)
      (identifier)
      (default_range_spec
        (string_literal)
        (string_literal)))))

======
Select-option restricted (No intervals)
======
SELECT-OPTIONS s_bukrs FOR gv_bukrs NO INTERVALS.
---

(source
  (select_options_declaration
    (select_options_spec
      (identifier)
      (identifier)
      (no_intervals_spec))))

======
Select-option restricted (No extension)
======
SELECT-OPTIONS s_kunnr FOR gv_kunnr NO-EXTENSION NO INTERVALS.
---

(source
  (select_options_declaration
    (select_options_spec
      (identifier)
      (identifier)
      (no_extension_spec)
      (no_intervals_spec))))

======
Select-option with search help and memory
======
SELECT-OPTIONS s_matnr FOR gv_matnr MEMORY ID mat MATCHCODE OBJECT mat1.
---

(source
  (select_options_declaration
    (select_options_spec
      (identifier)
      (identifier)
      (memory_id_spec
        (identifier))
      (search_help_spec
        (identifier)))))

======
Select-option with technical formatting
======
SELECT-OPTIONS s_id FOR gv_id VISIBLE LENGTH 10 NO-DISPLAY MODIF ID gr1.
---

(source
  (select_options_declaration
    (select_options_spec
      (identifier)
      (identifier)
      (visible_length_spec
        (number))
      (no_display_spec)
      (modif_id_spec
        (identifier)))))

======
Select-options chained declaration
======
SELECT-OPTIONS: 
  s_land FOR gv_land OBLIGATORY,
  s_city FOR gv_city NO-EXTENSION.
---

(source
  (select_options_declaration
    (select_options_spec
      (identifier)
      (identifier)
      (obligatory_spec))
    (select_options_spec
      (identifier)
      (identifier)
      (no_extension_spec))))

======
Select-option with lowercase and search help
======
SELECT-OPTIONS s_path FOR gv_path LOWER CASE MATCHCODE OBJECT zfile.
---

(source
  (select_options_declaration
    (select_options_spec
      (identifier)
      (identifier)
      (lower_case_spec)
      (search_help_spec
        (identifier)))))

======
[DYNPRO // SELECTION-SCREEN] Standard horzizonal line
======
SELECTION-SCREEN ULINE /10(20).
---

(source
  (selection_screen_statement
    (horizontal_line_element
      (output_position_spec
        position: (number)
        length: (number)))))

======
[DYNPRO // SELECTION-SCREEN] POS_HIGH/LOW horzizonal line
======
SELECTION-SCREEN ULINE POS_HIGH(10).
SELECTION-SCREEN ULINE POS_LOW(10).
---

(source
  (selection_screen_statement
    (horizontal_line_element
      (output_position_spec
        position: (identifier)
        length: (number))))
  (selection_screen_statement
    (horizontal_line_element
      (output_position_spec
        position: (identifier)
        length: (number)))))

======
[DYNPRO // SELECTION-SCREEN] Empty horzizonal line
======
SELECTION-SCREEN ULINE MODIF ID lin.
---

(source
  (selection_screen_statement
    (horizontal_line_element
      modif_id: (modif_id_spec
        id: (identifier)))))

======
[DYNPRO // SELECTION-SCREEN] Blank lines
======
SELECTION-SCREEN SKIP.
SELECTION-SCREEN SKIP 10.
selection-screen skip: 5, 3, 1.
---

(source
  (selection_screen_statement
    (blank_line_directive))
  (selection_screen_statement
    (blank_line_directive
      times: (number)))
  (selection_screen_statement
    (blank_line_directive
      times: (number)
      times: (number)
      times: (number))))

======
[DYNPRO // SELECTION-SCREEN] Begin/end of screen/block
======
selection-screen: begin of screen 100 title text-tt1 as window,
				          skip 10,
                  begin of block block with frame title text-tt2,
                  end of screen 100,
                  end of block block.
---

(source
  (selection_screen_statement
    (begin_of_screen_element
      (screen_spec
        dynnr: (number)
        title: (title_spec
          title: (struct_component_selector
            struct: (identifier)
            comp: (identifier)))
        window: (window_spec)))
    (blank_line_directive
      times: (number))
    (begin_of_block_element
      block: (identifier)
      frame: (frame_spec
        (title_spec
          title: (struct_component_selector
            struct: (identifier)
            comp: (identifier)))))
    (end_of_screen_element
      dynnr: (number))
    (end_of_block_element
      block: (identifier))))

======
[DYNPRO // SELECTION-SCREEN] Chained screen specifications
======
SELECTION-SCREEN BEGIN OF SCREEN: 100 as window title abab, 200 as window.
---

(source
  (selection_screen_statement
    (begin_of_screen_element
      (screen_spec
        dynnr: (number)
        window: (window_spec)
        title: (title_spec
          title: (identifier)))
      (screen_spec
        dynnr: (number)
        window: (window_spec)))))

======
[DYNPRO // SELECTION-SCREEN] Basic comment
======
SELECTION-SCREEN COMMENT /1(50) comm1 MODIF ID mg1. 
---

(source
  (selection_screen_statement
    (comment_element
      (comment_spec
        position: (output_position_spec
          position: (number)
          length: (number))
        text: (identifier)
        modif_id: (modif_id_spec
          id: (identifier))))))

======
[DYNPRO // SELECTION-SCREEN] Comment as label
======
SELECTION-SCREEN COMMENT /1(50) for field foo. 
---

(source
  (selection_screen_statement
    (comment_element
      (comment_spec
        position: (output_position_spec
          position: (number)
          length: (number))
        target: (for_screen_field_spec
          field: (identifier))))))

======
[DYNPRO // SELECTION-SCREEN] Comment as label with text
======
SELECTION-SCREEN COMMENT /1(50) bar for field foo. 
---

(source
  (selection_screen_statement
    (comment_element
      (comment_spec
        position: (output_position_spec
          position: (number)
          length: (number))
        target: (for_screen_field_spec
          text: (identifier)
          field: (identifier))))))

======
[DYNPRO // SELECTION-SCREEN] Subscreen definition
======
selection-screen: begin of screen 100 as subscreen nesting level 5,
                end of screen 100.
---

(source
  (selection_screen_statement
    (begin_of_screen_element
      (subscreen_spec
        dynnr: (number)
        nesting: (nesting_level_spec
          level: (number))))
    (end_of_screen_element
      dynnr: (number))))

======
[DYNPRO // SELECTION-SCREEN] Pushbuttons
======
SELECTION-SCREEN: 
  BEGIN OF SCREEN 500 AS WINDOW TITLE title, 
    PUSHBUTTON 2(10)  but1 USER-COMMAND cli1, 
    PUSHBUTTON 12(30) but2 USER-COMMAND cli2 
                           VISIBLE LENGTH 10, 
  END OF SCREEN 500. 
---

(source
  (selection_screen_statement
    (begin_of_screen_element
      (screen_spec
        dynnr: (number)
        window: (window_spec)
        title: (title_spec
          title: (identifier))))
    (pushbutton_element
      position: (output_position_spec
        position: (number)
        length: (number))
      text: (identifier)
      user_command: (user_command_spec
        command: (identifier)))
    (pushbutton_element
      position: (output_position_spec
        position: (number)
        length: (number))
      text: (identifier)
      user_command: (user_command_spec
        command: (identifier))
      visible_length: (visible_length_spec
        length: (number)))
    (end_of_screen_element
      dynnr: (number))))

======
[DYNPRO // SELECTION-SCREEN] Line / position directives
======
SELECTION-SCREEN: BEGIN OF LINE, 
                  PUSHBUTTON 2(10) push USER-COMMAND fcode, 
                  POSITION 16. 
PARAMETERS para TYPE c LENGTH 20. 
SELECTION-SCREEN: COMMENT 40(40) text, 
                  END OF LINE. 
---

(source
  (selection_screen_statement
    (begin_of_line_directive)
    (pushbutton_element
      position: (output_position_spec
        position: (number)
        length: (number))
      text: (identifier)
      user_command: (user_command_spec
        command: (identifier)))
    (screen_position_directive
      position: (output_position_spec
        position: (number))))
  (parameters_declaration
    (parameters_spec
      name: (identifier)
      typing: (builtin_type_spec
        name: (type_identifier)
        length: (number))))
  (selection_screen_statement
    (comment_element
      (comment_spec
        position: (output_position_spec
          position: (number)
          length: (number))
        text: (identifier)))
    (end_of_line_directive)))

======
[DYNPRO // SELECTION-SCREEN] Tabbed block
======
SELECTION-SCREEN: BEGIN OF TABBED BLOCK mytab FOR 10 LINES, 
                  TAB (20) button1 USER-COMMAND push1, 
                  TAB (20) button2 USER-COMMAND push2, 
                  END OF BLOCK mytab. 
---

(source
  (selection_screen_statement
    (begin_of_tabbed_block_element
      block: (identifier)
      lines: (tab_lines_spec
        number: (number)))
    (tab_element
      (tab_spec
        length: (number)
        name: (identifier)
        user_command: (user_command_spec
          command: (identifier))))
    (tab_element
      (tab_spec
        length: (number)
        name: (identifier)
        user_command: (user_command_spec
          command: (identifier))))
    (end_of_block_element
      block: (identifier))))

======
[DYNPRO // SELECTION-SCREEN] Chained tab block elements.
======
selection-screen TAB: (20) button1 USER-COMMAND push1,
                      (20) button2 USER-COMMAND push2.
---

(source
  (selection_screen_statement
    (tab_element
      (tab_spec
        length: (number)
        name: (identifier)
        user_command: (user_command_spec
          command: (identifier)))
      (tab_spec
        length: (number)
        name: (identifier)
        user_command: (user_command_spec
          command: (identifier))))))

======
[DYNPRO // SELECTION-SCREEN] Function keys
======
SELECTION-SCREEN: FUNCTION KEY 1,
                  FUNCTION KEY 2.
---

(source
  (selection_screen_statement
    (function_key_directive
      key: (number))
    (function_key_directive
      key: (number))))

======
[DYNPRO // SELECTION-SCREEN] Multiple function keys
======
selection-screen function key: 1, 2.
---

(source
  (selection_screen_statement
    (function_key_directive
      key: (number)
      key: (number))))

======
[DYNPRO // SELECTION-SCREEN] Include directives
======
SELECTION-SCREEN INCLUDE PUSHBUTTON /5(25) btn_text USER-COMMAND click.
SELECTION-SCREEN INCLUDE SELECT-OPTIONS s_date NO INTERVALS.
SELECTION-SCREEN INCLUDE PARAMETERS p_user OBLIGATORY OFF.
SELECTION-SCREEN INCLUDE BLOCKS part1.
---

(source
  (selection_screen_statement
    (include_pushbutton_directive
      (output_position_spec
        (number)
        (number))
      (identifier)
      (user_command_spec
        (identifier))))
  (selection_screen_statement
    (include_select_option_directive
      (identifier)
      (no_intervals_spec)))
  (selection_screen_statement
    (include_parameter_directive
      (identifier)
      (obligatory_spec)))
  (selection_screen_statement
    (include_block_directive
      (identifier))))

======
[DYNPRO // SELECTION-SCREEN] Call screen statement
======
CALL SELECTION-SCREEN '0500' STARTING AT 10 10 
                             ending at 20 10 
                             USING SELECTION-SET variant.
---

(source
  (call_sel_screen_statement
    dynnr: (string_literal)
    starting_at: (starting_at_spec
      column: (number)
      line: (number))
    ending_at: (ending_at_spec
      column: (number)
      line: (number))
    selection_set: (using_selection_set_spec
      variant: (identifier))))
