======
Simple single value filter
======
FILTER #( messages WHERE sprsl = 'D' )
---

(source
  (filter_expression
    (keyword_filter)
    (identifier)
    (keyword_where)
    (comparison_expression
      (identifier)
      (string_literal))))

======
Simple single reverted value filter
======
FILTER #( messages except WHERE sprsl = 'D' )
---

(source
  (filter_expression
    (keyword_filter)
    (identifier)
    (keyword_except)
    (keyword_where)
    (comparison_expression
      (identifier)
      (string_literal))))

======
Filter using specified key
======
FILTER #( spfli_tab EXCEPT USING KEY carr_city 
            WHERE carrid   = CONV #( to_upper( carrid ) ) AND 
                cityfrom = CONV #( to_upper( cityfrom ) ) ). 
---

(source
  (filter_expression
    (keyword_filter)
    (identifier)
    (keyword_except)
    (using_key_spec
      (keyword_using)
      (keyword_key)
      (identifier))
    (keyword_where)
    (logical_expression
      (comparison_expression
        (identifier)
        (conv_expression
          (keyword_conv)
          (builtin_function_call
            (identifier)
            (call_argument_list
              (positional_argument
                (identifier))))))
      (keyword_and)
      (comparison_expression
        (identifier)
        (conv_expression
          (keyword_conv)
          (builtin_function_call
            (identifier)
            (call_argument_list
              (positional_argument
                (identifier)))))))))

======
Filter table with no keys specified
======
FILTER #( carriers IN filter WHERE carrid = table_line )
---

(source
  (filter_expression
    (keyword_filter)
    (identifier)
    (filter_tab_spec
      (keyword_in)
      (identifier))
    (keyword_where)
    (comparison_expression
      (identifier)
      (identifier))))

======
Filter table with source key
======
FILTER #( carriers using key foo IN filter WHERE carrid = table_line )
---

(source
  (filter_expression
    (keyword_filter)
    (identifier)
    (using_key_spec
      (keyword_using)
      (keyword_key)
      (identifier))
    (filter_tab_spec
      (keyword_in)
      (identifier))
    (keyword_where)
    (comparison_expression
      (identifier)
      (identifier))))

======
Filter table with filter key
======
FILTER #( carriers IN filter using key bar WHERE carrid = table_line )
---

(source
  (filter_expression
    (keyword_filter)
    (identifier)
    (filter_tab_spec
      (keyword_in)
      (identifier)
      (using_key_spec
        (keyword_using)
        (keyword_key)
        (identifier)))
    (keyword_where)
    (comparison_expression
      (identifier)
      (identifier))))
