==================
Table comprehension with counter
==================
VALUE #( FOR j = 1 UNTIL j > 5 ( rnd1->get_next( ) ) )
---

(source
  (value_expression
    (keyword_value)
    (itab_expression
      (conditional_iteration
        (keyword_for)
        (assignment
          (identifier)
          (number))
        (keyword_until)
        (comparison_expression
          (identifier)
          (number)))
      (line_spec
        (argument_list
          (positional_argument
            (method_call
              (identifier)
              (identifier))))))))

==================
Table comprehension with index
==================
VALUE carriers( FOR wa IN scarr_tab INDEX INTO i ( no = i  ) ). 
---

(source
  (value_expression
    (keyword_value)
    (type_identifier)
    (itab_expression
      (table_iteration
        (keyword_for)
        (identifier)
        (keyword_in)
        (identifier)
        (keyword_index)
        (keyword_into)
        (identifier))
      (line_spec
        (argument_list
          (named_argument
            (identifier)
            (identifier)))))))

==================
Nested table comprehension
==================
VALUE itab2( 
      FOR wa1 IN itab1 
      	FOR wa2 IN wa1-col 
          ( col1 = wa1-col1 
            col2 = wa2-col1 
            col3 = wa2-col2 ) )
---

(source
  (value_expression
    (keyword_value)
    (type_identifier)
    (itab_expression
      (table_iteration
        (keyword_for)
        (identifier)
        (keyword_in)
        (identifier))
      (table_iteration
        (keyword_for)
        (identifier)
        (keyword_in)
        (struct_component_selector
          (identifier)
          (identifier)))
      (line_spec
        (argument_list
          (named_argument
            (identifier)
            (struct_component_selector
              (identifier)
              (identifier)))
          (named_argument
            (identifier)
            (struct_component_selector
              (identifier)
              (identifier)))
          (named_argument
            (identifier)
            (struct_component_selector
              (identifier)
              (identifier))))))))

==================
Table comprehension with where clause
==================
value_tab = VALUE #( FOR wa IN messages WHERE ( sprsl = 'E' ) ( wa ) ). 
---

(source
  (assignment
    (identifier)
    (value_expression
      (keyword_value)
      (itab_expression
        (table_iteration
          (keyword_for)
          (identifier)
          (keyword_in)
          (identifier)
          (iteration_cond
            (keyword_where)
            (parenthesized_expression)
            (parenthesized_expression
              (comparison_expression
                (identifier)
                (string_literal)))
            (parenthesized_expression)))
        (line_spec
          (argument_list
            (positional_argument
              (identifier))))))))

==================
Table comprehension with dynamic where clause
==================
value_tab = VALUE #( FOR wa IN messages WHERE (cond) ( wa ) ). 
---

(source
  (assignment
    (identifier)
    (value_expression
      (keyword_value)
      (itab_expression
        (table_iteration
          (keyword_for)
          (identifier)
          (keyword_in)
          (identifier)
          (iteration_cond
            (keyword_where)
            (dynamic_cond
              (identifier))))
        (line_spec
          (argument_list
            (positional_argument
              (identifier))))))))

==================
Table comprehension with dynamic where clause table
==================
value_tab = VALUE #( FOR wa IN messages WHERE ( (cond_tab) ) ( wa ) ). 
---

(source
  (assignment
    (identifier)
    (value_expression
      (keyword_value)
      (itab_expression
        (table_iteration
          (keyword_for)
          (identifier)
          (keyword_in)
          (identifier)
          (iteration_cond
            (keyword_where)
            (dynamic_cond_tab
              (identifier))))
        (line_spec
          (argument_list
            (positional_argument
              (identifier))))))))

==================
Table comprehension with slice and step size
==================
VALUE #( FOR <fs> IN itab INDEX INTO tabix FROM 4 TO 16 
      	 STEP 2 ( tabix = tabix value = <fs> ) ). 
---

(source
  (value_expression
    (keyword_value)
    (itab_expression
      (table_iteration
        (keyword_for)
        (field_symbol
          (identifier))
        (keyword_in)
        (identifier)
        (keyword_index)
        (keyword_into)
        (identifier)
        (iterate_from_index_spec
          (keyword_from)
          (number))
        (iterate_to_index_spec
          (keyword_to)
          (number))
        (iterate_step_spec
          (keyword_step)
          (number)))
      (line_spec
        (argument_list
          (named_argument
            (identifier)
            (identifier))
          (named_argument
            (identifier)
            (field_symbol
              (identifier))))))))

==================
Table comprehension with slice and step size and key
==================
VALUE #( FOR <fs> IN itab INDEX INTO tabix 
      USING KEY sortkey FROM 16 TO 4 STEP -2 
            ( tabix = tabix value = <fs> ) )
---

(source
  (value_expression
    (keyword_value)
    (itab_expression
      (table_iteration
        (keyword_for)
        (field_symbol
          (identifier))
        (keyword_in)
        (identifier)
        (keyword_index)
        (keyword_into)
        (identifier)
        (iteration_cond
          (using_key_spec
            (keyword_using)
            (keyword_key)
            (identifier)))
        (iterate_from_index_spec
          (keyword_from)
          (number))
        (iterate_to_index_spec
          (keyword_to)
          (number))
        (iterate_step_spec
          (keyword_step)
          (number)))
      (line_spec
        (argument_list
          (named_argument
            (identifier)
            (identifier))
          (named_argument
            (identifier)
            (field_symbol
              (identifier))))))))

==================
Table comprehension with then expression
==================
VALUE itab1( FOR j = 41 THEN j - 10 UNTIL j < 10 ( ) )
---

(source
  (value_expression
    (keyword_value)
    (type_identifier)
    (itab_expression
      (conditional_iteration
        (keyword_for)
        (assignment
          (identifier)
          (number))
        (keyword_then)
        (binary_operator
          (identifier)
          (number))
        (keyword_until)
        (comparison_expression
          (identifier)
          (number)))
      (line_spec))))

==================
Table comprehension with lines from index
==================
VALUE itab3( 
      FOR wa IN itab1 INDEX INTO idx WHERE ( col1 = 21 )
        ( LINES OF itab1 FROM idx ) )
---

(source
  (value_expression
    (keyword_value)
    (type_identifier)
    (itab_expression
      (table_iteration
        (keyword_for)
        (identifier)
        (keyword_in)
        (identifier)
        (keyword_index)
        (keyword_into)
        (identifier)
        (iteration_cond
          (keyword_where)
          (parenthesized_expression)
          (parenthesized_expression
            (comparison_expression
              (identifier)
              (number)))
          (parenthesized_expression)))
      (line_spec
        (lines_of
          (keyword_lines)
          (keyword_of)
          (identifier)
          (keyword_from)
          (identifier))))))

==================
Table comprehension with let expressions
==================
VALUE itab( 
   LET bias = 100000 IN 
   FOR i = 1 UNTIL i > 5 
     LET x = rnd->get_next( ) 
         y = x * x 
         z = i * 1000 IN 
          ( col1 = bias + x + z 
            col2 = bias + y + z ) ).
---

(source
  (value_expression
    (keyword_value)
    (type_identifier)
    (itab_expression
      (let_expression
        (keyword_let)
        (assignment
          (identifier)
          (number)))
      (keyword_in)
      (conditional_iteration
        (keyword_for)
        (assignment
          (identifier)
          (number))
        (keyword_until)
        (comparison_expression
          (identifier)
          (number))
        (let_expression
          (keyword_let)
          (assignment
            (identifier)
            (method_call
              (identifier)
              (identifier)))
          (assignment
            (identifier)
            (binary_operator
              (identifier)
              (identifier)))
          (assignment
            (identifier)
            (binary_operator
              (identifier)
              (number))))
        (keyword_in))
      (line_spec
        (argument_list
          (named_argument
            (identifier)
            (binary_operator
              (binary_operator
                (identifier)
                (identifier))
              (identifier)))
          (named_argument
            (identifier)
            (binary_operator
              (binary_operator
                (identifier)
                (identifier))
              (identifier))))))))
