======
[LOOP-AT] Simple loop
======
loop at requests into request.
endloop.
---

(source
  (loop_at_statement
    subject: (identifier)
    result: (into_spec
      work_area: (identifier))))

======
[LOOP-AT] Loop into reference
======
loop at requests reference into data(request).
endloop.
---

(source
  (loop_at_statement
    subject: (identifier)
    result: (reference_into_spec
      work_area: (declaration_expression
        name: (identifier)))))

======
[LOOP-AT] Loop at with inline declarations
======
LOOP AT VALUE t_itab( ( 1 ) ( 2 ) ( 3 ) ) ASSIGNING FIELD-SYMBOL(<fs>). 
ENDLOOP. 
---

(source
  (loop_at_statement
    subject: (value_expression
      type: (type_identifier)
      (itab_expression
        (line_spec
          value: (argument_list
            (positional_argument
              value: (number))))
        (line_spec
          value: (argument_list
            (positional_argument
              value: (number))))
        (line_spec
          value: (argument_list
            (positional_argument
              value: (number))))))
    result: (assigning_spec
      work_area: (declaration_expression
        name: (identifier)))))

======
[LOOP-AT] Nested loop at
======
LOOP AT scarr_tab ASSIGNING FIELD-SYMBOL(<scarr_line>) 
                  WHERE carrname CP name. 
  LOOP AT spfli_tab INTO FINAL(spfli_line) 
                    WHERE carrid = <scarr_line>-carrid. 
  ENDLOOP. 
ENDLOOP. 
---

(source
  (loop_at_statement
    subject: (identifier)
    result: (assigning_spec
      work_area: (declaration_expression
        name: (identifier)))
    condition: (iteration_cond
      condition: (comparison_expression
        left: (identifier)
        right: (identifier)))
    body: (loop_at_body
      (loop_at_statement
        subject: (identifier)
        result: (into_spec
          work_area: (declaration_expression
            name: (identifier)))
        condition: (iteration_cond
          condition: (comparison_expression
            left: (identifier)
            right: (binary_operator
              left: (field_symbol
                name: (identifier))
              right: (identifier))))))))

======
[LOOP-AT] Specifying an explicit key
======
LOOP AT itab INTO FINAL(number2) USING KEY key. 
ENDLOOP. 
---

(source
  (loop_at_statement
    subject: (identifier)
    result: (into_spec
      work_area: (declaration_expression
        name: (identifier)))
    condition: (iteration_cond
      (using_key_spec
        name: (identifier)))))

======
[LOOP-AT] Loop from index
======
LOOP AT itab FROM lines( itab ) ASSIGNING FIELD-SYMBOL(<fs>). 
ENDLOOP.
---

(source
  (loop_at_statement
    subject: (identifier)
    from: (iterate_from_index_spec
      index: (builtin_function_call
        name: (identifier)
        (call_argument_list
          exporting: (positional_argument
            value: (identifier)))))
    result: (assigning_spec
      work_area: (declaration_expression
        name: (identifier)))))

======
[LOOP-AT] Sliced loop with step
======
LOOP AT itab FROM 3 STEP -1 ASSIGNING FIELD-SYMBOL(<fs>) TO 1. 
ENDLOOP. 
---

(source
  (loop_at_statement
    subject: (identifier)
    from: (iterate_from_index_spec
      index: (number))
    step: (iterate_step_spec
      size: (number))
    result: (assigning_spec
      work_area: (declaration_expression
        name: (identifier)))
    to: (iterate_to_index_spec
      index: (number))))

======
[LOOP-AT] Where condition with dereference
======
LOOP AT itab INTO line FROM 10 TO 25 WHERE col2 > dref->*. 
ENDLOOP. 
---

(source
  (loop_at_statement
    subject: (identifier)
    result: (into_spec
      work_area: (identifier))
    from: (iterate_from_index_spec
      index: (number))
    to: (iterate_to_index_spec
      index: (number))
    condition: (iteration_cond
      condition: (comparison_expression
        left: (identifier)
        right: (dereference
          dref: (identifier))))))

======
[LOOP-AT] Dynamic where condition
======
LOOP AT itab INTO line FROM 10 TO 25 WHERE (cond). 
ENDLOOP. 
---

(source
  (loop_at_statement
    subject: (identifier)
    result: (into_spec
      work_area: (identifier))
    from: (iterate_from_index_spec
      index: (number))
    to: (iterate_to_index_spec
      index: (number))
    condition: (iteration_cond
      condition: (dynamic_cond
        name: (identifier)))))

======
[LOOP-AT] Loop without transporting fields
======
LOOP AT itab TRANSPORTING NO FIELDS WHERE table_line >= 40.  
ENDLOOP.
---

(source
  (loop_at_statement
    subject: (identifier)
    result: (transporting_no_fields_spec)
    condition: (iteration_cond
      condition: (comparison_expression
        left: (identifier)
        right: (number)))))

======
[LOOP-AT] Group level processing in simple loop
======
LOOP AT itab ASSIGNING FIELD-SYMBOL(<fs>). 
  AT FIRST.
  ENDAT.
  AT NEW comp1.
  ENDAT.
  AT END OF comp1.
  ENDAT.
  AT LAST. 
  ENDAT. 
ENDLOOP. 
---

(source
  (loop_at_statement
    subject: (identifier)
    result: (assigning_spec
      work_area: (declaration_expression
        name: (identifier)))
    body: (loop_at_body
      (at_first_statement)
      (at_new_statement
        component: (identifier))
      (at_end_of_statement
        component: (identifier))
      (at_last_statement))))

======
[LOOP-AT] Group by using group index / size
======
LOOP AT spfli_tab INTO FINAL(wa) 
                  GROUP BY ( key1 = wa-carrid key2 = wa-airpfrom 
                             indx = GROUP INDEX 
                             size = GROUP SIZE ) 
                  INTO data(key). 
ENDLOOP. 
---

(source
  (loop_at_statement
    subject: (identifier)
    result: (into_spec
      work_area: (declaration_expression
        name: (identifier)))
    grouping: (group_by_spec
      key: (group_key
        (group_key_component_spec
          field: (identifier)
          value: (struct_component_selector
            struct: (identifier)
            comp: (identifier)))
        (group_key_component_spec
          field: (identifier)
          value: (struct_component_selector
            struct: (identifier)
            comp: (identifier)))
        (group_index_assignment
          field: (identifier))
        (group_size_assignment
          field: (identifier)))
      group_result: (into_spec
        work_area: (declaration_expression
          name: (identifier))))))

======
[LOOP-AT] Group by using expression key
======
LOOP AT itab ASSIGNING FIELD-SYMBOL(<line>) 
              GROUP BY to_upper( <line> ) ASCENDING 
              ASSIGNING FIELD-SYMBOL(<grp1>). 

ENDLOOP. 
---

(source
  (loop_at_statement
    subject: (identifier)
    result: (assigning_spec
      work_area: (declaration_expression
        name: (identifier)))
    grouping: (group_by_spec
      key: (group_key
        expression: (builtin_function_call
          name: (identifier)
          (call_argument_list
            exporting: (positional_argument
              value: (field_symbol
                name: (identifier))))))
      order: (sort_order_spec)
      group_result: (assigning_spec
        work_area: (declaration_expression
          name: (identifier))))))

======
[LOOP-AT] Loop at group
======
LOOP AT spfli_tab INTO FINAL(wa) 
                  GROUP BY wa-carrid 
                  INTO FINAL(key). 
  LOOP AT GROUP key ASSIGNING FIELD-SYMBOL(<members>) 
                    WHERE cityfrom = 'NEW YORK'. 
  ENDLOOP. 
ENDLOOP. 
---

(source
  (loop_at_statement
    subject: (identifier)
    result: (into_spec
      work_area: (declaration_expression
        name: (identifier)))
    grouping: (group_by_spec
      key: (group_key
        expression: (struct_component_selector
          struct: (identifier)
          comp: (identifier)))
      group_result: (into_spec
        work_area: (declaration_expression
          name: (identifier))))
    body: (loop_at_body
      (loop_at_group_statement
        subject: (identifier)
        result: (assigning_spec
          work_area: (declaration_expression
            name: (identifier)))
        condition: (iteration_cond
          condition: (comparison_expression
            left: (identifier)
            right: (string_literal)))))))
