======
Static compact form message spec
======
message i333(zmessages).
---

(source
  (message
    (keyword_message)
    (message_spec
      type: (message_type)
      number: (number)
      id: (identifier))))

======
Static compact form message with default id
======
message e220.
---

(source
  (message
    (keyword_message)
    (message_spec
      type: (message_type)
      number: (number))))

======
Message from plain text
======
message e220.
---

(source
  (message
    (keyword_message)
    (message_spec
      type: (message_type)
      number: (number))))

======
Dynamic long form message spec
======
message id mid type mtyp number mnum.
---

(source
  (message
    (keyword_message)
    (message_spec
      (keyword_id)
      id: (identifier)
      (keyword_type)
      type: (identifier)
      (keyword_number)
      number: (identifier))))

======
Dynamic long form with literals
======
message id 'ZMESSAGES' type 'A' number 999.
---

(source
  (message
    (keyword_message)
    (message_spec
      (keyword_id)
      id: (string_literal)
      (keyword_type)
      type: (string_literal)
      (keyword_number)
      number: (number))))

======
Message spec with argument list
======
message e888(msg_class) with 'Foo' 'Bar' 'Baz'.
---

(source
  (message
    (keyword_message)
    (message_spec
      type: (message_type)
      number: (number)
      id: (identifier)
      arguments: (message_arguments
        (keyword_with)
        (string_literal)
        (string_literal)
        (string_literal)))))

======
Chained mixed message declarations
======
message: e888(msg_class) with 'Foo' 'Bar' 'Baz', 
         i222 with '1' '2' '3',
         id 'zbar' type 'X' number 11.
---

(source
  (message
    (keyword_message)
    (message_spec
      type: (message_type)
      number: (number)
      id: (identifier)
      arguments: (message_arguments
        (keyword_with)
        (string_literal)
        (string_literal)
        (string_literal)))
    (message_spec
      type: (message_type)
      number: (number)
      arguments: (message_arguments
        (keyword_with)
        (string_literal)
        (string_literal)
        (string_literal)))
    (message_spec
      (keyword_id)
      id: (string_literal)
      (keyword_type)
      type: (string_literal)
      (keyword_number)
      number: (number))))

======
Message display type override
======
MESSAGE i200 DISPLAY LIKE 'S'.
---

(source
  (message
    (keyword_message)
    (message_spec
      type: (message_type)
      number: (number)
      display: (keyword_display)
      display: (keyword_like)
      display_type: (string_literal))))

======
Message from expressions
======
message conv string( lines( itab ) ) type 'I'.
---

(source
  (message
    (keyword_message)
    (message_spec
      (conv_expression
        (keyword_conv)
        (type_identifier)
        (builtin_function_call
          (identifier)
          (call_argument_list
            (positional_argument
              (identifier)))))
      (keyword_type)
      (string_literal))))

======
Message from method call
======
MESSAGE oref->get_text( ) TYPE 'I'. 
---

(source
  (message
    (keyword_message)
    (message_spec
      (method_call
        (identifier)
        (identifier))
      (keyword_type)
      (string_literal))))

======
Message raising an exception
======
MESSAGE 'Message in a Method' TYPE 'I' RAISING exc1. 
---

(source
  (message
    (keyword_message)
    (message_spec
      text: (string_literal)
      (keyword_type)
      type: (string_literal)
      (keyword_raising)
      raising: (identifier))))

======
Message into target variable / declaration
======
MESSAGE ID sy-msgid TYPE sy-msgty NUMBER sy-msgno 
        INTO FINAL(mtext) 
        WITH sy-msgv1 sy-msgv2 sy-msgv3 sy-msgv4. 
---

(source
  (message
    (keyword_message)
    (message_spec
      (keyword_id)
      id: (struct_component_selector
        struct: (identifier)
        comp: (identifier))
      (keyword_type)
      type: (struct_component_selector
        struct: (identifier)
        comp: (identifier))
      (keyword_number)
      number: (struct_component_selector
        struct: (identifier)
        comp: (identifier))
      (keyword_into)
      into: (declaration_expression
        (keyword_final)
        name: (identifier))
      arguments: (message_arguments
        (keyword_with)
        (struct_component_selector
          struct: (identifier)
          comp: (identifier))
        (struct_component_selector
          struct: (identifier)
          comp: (identifier))
        (struct_component_selector
          struct: (identifier)
          comp: (identifier))
        (struct_component_selector
          struct: (identifier)
          comp: (identifier))))))

======
[MESSAGES] Message with symbol tagged string literal
======
message i368(00) with 'No import possible for transport'(002) <ls_request>-trkorr.
---

(source
  (message
    (keyword_message)
    (message_spec
      type: (message_type)
      number: (number)
      id: (number)
      arguments: (message_arguments
        (keyword_with)
        (symbol_tagged_string_literal
          text: (string_literal)
          symbol: (number))
        (binary_operator
          left: (field_symbol
            name: (identifier))
          right: (identifier))))))
