==================
With explicit type and value
==================
NEW i( 555 )
---
(source
    (new_expression
        (identifier)
        (argument_list
            (positional_argument
            (number)))))
==================
Initial derived value
==================
NEW #( )
---
(source
    (new_expression))
==================
Value with let expr
==================
NEW string( let var = 'A String' in |Using let expression { var }| )
---
(source
    (new_expression
    (identifier)
    (argument_list
        (let_expression
            (let_spec
                (identifier)
                (literal_string)))
        (positional_argument
            (string_template
                (embedded_expression
                (identifier)))))))
==================
Itab with base spec
==================
NEW #( BASE base1 col2 = 'BB' ). 
NEW #( BASE base1->* col2 = 'BB' ). 
NEW #( BASE /www/my_class=>base_itab col2 = 'BB' ). 
---
(source
    (new_expression
        (itab_spec
            (base_spec
                (identifier))
            (argument_list
                (named_argument
                    (identifier)
                    (literal_string)))))
    (new_expression
        (itab_spec
            (base_spec
                (dereference
                (identifier)))
            (argument_list
                (named_argument
                    (identifier)
                    (literal_string)))))
    (new_expression
        (itab_spec
            (base_spec
                (class_component_selector
                (identifier)
                (identifier)))
            (argument_list
                (named_argument
                    (identifier)
                    (literal_string))))))
==================
itab sub-component assignment
==================
NEW t_struct( col2-col1 = 2 col2-col2 = itab ).
---
(source
    (new_expression
        (identifier)
        (argument_list
            (named_argument
                (struct_component_selector
                    (identifier)
                    (static_component
                    (identifier)))
                (number))
            (named_argument
                (struct_component_selector
                    (identifier)
                    (static_component
                    (identifier)))
                (identifier)))))