======
[READ-TABLE] Simple index read
======
READ TABLE itab WITH KEY table_line = 10 TRANSPORTING NO FIELDS.
---

(source
  (read_table_statement
    (identifier)
    (itab_table_key_spec
      (search_key_components_spec
        (itab_comp_spec_list
          (itab_comp_spec
            (identifier)
            (number)))))
    (transporting_no_fields_spec)))

======
[READ-TABLE] Simple index read with key
======
READ TABLE itab WITH KEY skey COMPONENTS table_line = 10 
                         TRANSPORTING NO FIELDS. 
---

(source
  (read_table_statement
    (identifier)
    (itab_table_key_spec
      (identifier)
      (search_key_components_spec
        (itab_comp_spec_list
          (itab_comp_spec
            (identifier)
            (number)))))
    (transporting_no_fields_spec)))

======
[READ-TABLE] Read from work area
======
READ TABLE spfli_tab FROM spfli_key 
           ASSIGNING FIELD-SYMBOL(<spfli>). 
---

(source
  (read_table_statement
    (identifier)
    (itab_work_area_spec
      (identifier))
    (assigning
      (declaration_expression
        (identifier)))))

======
[READ-TABLE] Read from work area with key
======
READ TABLE spfli_tab FROM spfli_key USING KEY city_key 
           ASSIGNING <spfli>. 
---

(source
  (read_table_statement
    (identifier)
    (itab_work_area_spec
      (identifier)
      (using_key_spec
        (identifier)))
    (assigning
      (field_symbol
        (identifier)))))

======
[READ-TABLE] Read with free key
======
READ TABLE html_viewer_tab 
           WITH KEY table_line->parent = container 
           INTO html_viewer. 
---

(source
  (read_table_statement
    (identifier)
    (itab_table_key_spec
      (search_key_components_spec
        (itab_comp_spec_list
          (itab_comp_spec
            (object_component_selector
              (identifier)
              (identifier))
            (identifier)))))
    (read_into_work_area
      (identifier))))

======
[READ-TABLE] Read with free key and binary search
======
READ TABLE sflight_tab 
     WITH KEY carrid = 'LH' connid = '400' fldate = '20240627' 
     BINARY SEARCH 
     ASSIGNING FIELD-SYMBOL(<flight>).
---

(source
  (read_table_statement
    (identifier)
    (itab_table_key_spec
      (search_key_components_spec
        (itab_comp_spec_list
          (itab_comp_spec
            (identifier)
            (string_literal))
          (itab_comp_spec
            (identifier)
            (string_literal))
          (itab_comp_spec
            (identifier)
            (string_literal)))
        (binary_search)))
    (assigning
      (declaration_expression
        (identifier)))))

======
[READ-TABLE] Read with where condition
======
READ TABLE itab INTO text_short 
          WHERE table_line = text_long.
---

(source
  (read_table_statement
    (identifier)
    (read_into_work_area
      (identifier))
    (iteration_cond
      (comparison_expression
        (identifier)
        (identifier)))))

======
[READ-TABLE] Ready index with special transport options
======
READ TABLE sflight_tab 
       INDEX sy-index 
       INTO sflight_wa COMPARING seatsocc 
                       TRANSPORTING carrid 
                                    connid 
                                    fldate 
                                    seatsocc. 
---

(source
  (read_table_statement
    (identifier)
    (itab_index_spec
      (struct_component_selector
        (identifier)
        (identifier)))
    (read_into_work_area
      (identifier)
      (comparing_fields_spec
        (itab_component_list
          (identifier)))
      (transporting_components
        (itab_component_list
          (identifier)
          (identifier)
          (identifier)
          (identifier))))))
