=======
Literal Strings
=======
`Literal String`.
'Literal char'.
`##`.
'##'.
`"foo`.
---
(source
    (literal_string)
    (literal_string)
    (literal_string)
    (literal_string)
    (literal_string))
=======
Template Strings without embeds
=======
|Template String without embedded expresion|
---
(source
    (string_template))
=======
Template strings with embed
=======
|Template String with { 1 } embedded expresion|
---
(source
    (string_template
        (embedded_expression
            (number))))
=======
String concatenation
=======
`ABAP` && `is` && 'a' && gc_programming && cls=>language( ).
---
(source
    (string_operator
        (string_operator
            (string_operator
                (string_operator
                    (literal_string)
                    (literal_string))
                (literal_string))
            (identifier))
        (method_call
            (identifier)
            (identifier)
            (call_arguments))))
=======
Template string with extra prefixes
=======
|"{ 200 }" 321txeT;|.
|##{ 200 }" 321txeT;|.
---
(source
    (string_template
        (embedded_expression
            (number)))
    (string_template
        (embedded_expression
            (number))))
=======
Template string escape characters
=======
|\\ \\|\|\|\|\ \| \{\} \{    \} \{ \}|.
---
(source
    (string_template))

======
Condense with gaps
======
CONDENSE text.
CONDENSE 'aaaaaa'.
CONDENSE foo-bar.
CONDENSE obj->attr.
---
(source
    (condense
        (identifier))
    (condense
        (literal_string))
    (condense
        (struct_component_selector
            (identifier)
            (static_component
            (identifier))))
    (condense
        (object_component_selector
            (identifier)
            (static_component
                (identifier)))))
======
Condense without gaps
======
CONDENSE text no-gaps.
---
(source
    (condense
        (identifier)))