=======
Literal Strings
=======
`Literal String`.
'Literal char'.
`##`.
'##'.
`"foo`.
---
(source
    (literal_string)
    (literal_string)
    (literal_string)
    (literal_string)
    (literal_string))
=======
Template Strings without embeds
=======
|Template String without embedded expresion|
---
(source
    (string_template))
=======
Template strings with embed
=======
|Template String with { 1 } embedded expresion|
---
(source
    (string_template
        (embedded_expression
            (number))))
=======
String concatenation
=======
`ABAP` && `is` && 'a' && gc_programming && cls=>language( ).
---
(source
    (string_operator
        (string_operator
            (string_operator
                (string_operator
                    (literal_string)
                    (literal_string))
                (literal_string))
            (identifier))
        (method_call
            (identifier)
            (identifier))))
=======
Template string with extra prefixes
=======
|"{ 200 }" 321txeT;|.
|##{ 200 }" 321txeT;|.
---
(source
    (string_template
        (embedded_expression
            (number)))
    (string_template
        (embedded_expression
            (number))))
=======
Template string escape characters
=======
|\\ \\|\|\|\|\ \| \{\} \{    \} \{ \}|.
---
(source
    (string_template))

======
Condense with gaps
======
CONDENSE text.
CONDENSE 'aaaaaa'.
CONDENSE foo-bar.
CONDENSE obj->attr.
---
(source
    (condense
        (identifier))
    (condense
        (literal_string))
    (condense
        (struct_component_selector
            (identifier)
            (static_component
            (identifier))))
    (condense
        (object_component_selector
            (identifier)
            (static_component
                (identifier)))))
======
Condense without gaps
======
CONDENSE text no-gaps.
---
(source
    (condense
        (identifier)))
======
Substring access offset only
======
my_string+off.
my_string+10.
---
(source
    (substring_access
        target: (identifier)
        offset: (identifier))
    (substring_access
        target: (identifier)
        offset: (number)))
======
Substring access length only
======
my_string(len).
my_string(10).
---
(source
    (substring_access
        target: (identifier)
        length: (identifier))
    (substring_access
        target: (identifier)
        length: (number)))
======
Substring access offset and length
======
my_string+off(len).
my_string+10(10).
---
(source
    (substring_access
        target: (identifier)
        offset: (identifier)
        length: (identifier))
    (substring_access
        target: (identifier)
        offset: (number)
        length: (number)))
======
Substring access from dereference
======
ref->*+10(length).
---
(source
    (substring_access
        target: (dereference
            dref: (identifier))
        offset: (number)
        length: (identifier)))
======
Substring access from field-symbol
======
<fs>+offset(10).
---
(source
    (substring_access
        target: (field_symbol
            name: (identifier))
        offset: (identifier)
        length: (number)))
======
Substring access from comp access
======
test-var1(10)
---
(source
    (substring_access
        target: (struct_component_selector
            struct: (identifier)
            comp: (static_component
                name: (identifier)))
        length: (number)))